In [1]:
import pandas as pd

In [2]:
age  = [23,34,55,55,66,55,88,99,45,77]
series = pd.Series(age)

In [8]:
series

0    23
1    34
2    55
3    55
4    66
5    55
6    88
7    99
8    45
9    77
dtype: int64

In [9]:
series[0:4]

0    23
1    34
2    55
3    55
dtype: int64

In [10]:
series[0]

23

In [11]:
series[-1]

KeyError: -1

In [12]:
series.shape

(10,)

In [13]:
series.index

RangeIndex(start=0, stop=10, step=1)

In [14]:
pd.Series([23,34,77,56,23,99], index = ['a','b','c','d','e','f'])

a    23
b    34
c    77
d    56
e    23
f    99
dtype: int64

In [15]:
df = pd.DataFrame(series)

In [16]:
data  = {
    'Names' : ['Sachin', 'Virat', 'Dhoni', 'Yuvraj', 'Dhawan', 'Rahul', 'Pant'],
    'Scores' : [45,66,74,103,45,65,66],
    'Avg' : [45.66,54.88,73.88,63.22,22.43,76.43,66.32]
}

In [17]:
df = pd.DataFrame(data)

In [18]:
df

    Names  Scores    Avg
0  Sachin      45  45.66
1   Virat      66  54.88
2   Dhoni      74  73.88
3  Yuvraj     103  63.22
4  Dhawan      45  22.43
5   Rahul      65  76.43
6    Pant      66  66.32

In [19]:
df.shape

(7, 3)

In [20]:
df.columns

Index(['Names', 'Scores', 'Avg'], dtype='object')

In [21]:
df.describe()

           Scores        Avg
count    7.000000   7.000000
mean    66.285714  57.545714
std     19.644459  18.770990
min     45.000000  22.430000
25%     55.000000  50.270000
50%     66.000000  63.220000
75%     70.000000  70.100000
max    103.000000  76.430000

In [22]:
pd.DataFrame([[12,34,53,55],[12,87,33,83],[77,77,93,53]])

    0   1   2   3
0  12  34  53  55
1  12  87  33  83
2  77  77  93  53

In [23]:
pd.DataFrame([[12,34,53,55],[12,87,33,83],[77,77,93,53]], 
             columns=['a','b','c','d'],
            index= ['i','j','k'])

    a   b   c   d
i  12  34  53  55
j  12  87  33  83
k  77  77  93  53

In [24]:
#it will return first five observation

df.head()

    Names  Scores    Avg
0  Sachin      45  45.66
1   Virat      66  54.88
2   Dhoni      74  73.88
3  Yuvraj     103  63.22
4  Dhawan      45  22.43

In [25]:
df.tail()

    Names  Scores    Avg
2   Dhoni      74  73.88
3  Yuvraj     103  63.22
4  Dhawan      45  22.43
5   Rahul      65  76.43
6    Pant      66  66.32

In [26]:
df['Names'][0]

'Sachin'

In [27]:
#only this slicing is valid

df[0:3]

    Names  Scores    Avg
0  Sachin      45  45.66
1   Virat      66  54.88
2   Dhoni      74  73.88

In [28]:
df.loc[0]

Names     Sachin
Scores        45
Avg        45.66
Name: 0, dtype: object

In [29]:
df.loc[1]

Names     Virat
Scores       66
Avg       54.88
Name: 1, dtype: object

In [30]:
df.loc[0:5]

    Names  Scores    Avg
0  Sachin      45  45.66
1   Virat      66  54.88
2   Dhoni      74  73.88
3  Yuvraj     103  63.22
4  Dhawan      45  22.43
5   Rahul      65  76.43

In [31]:
#indexing and slicing
df.iloc[0]

Names     Sachin
Scores        45
Avg        45.66
Name: 0, dtype: object

In [32]:
df.iloc[0:3]

    Names  Scores    Avg
0  Sachin      45  45.66
1   Virat      66  54.88
2   Dhoni      74  73.88

In [33]:
df.iloc[0:4,0:2]

    Names  Scores
0  Sachin      45
1   Virat      66
2   Dhoni      74
3  Yuvraj     103

In [34]:
df['Names']

0    Sachin
1     Virat
2     Dhoni
3    Yuvraj
4    Dhawan
5     Rahul
6      Pant
Name: Names, dtype: object

In [35]:
df[['Names','Scores']].head()

    Names  Scores
0  Sachin      45
1   Virat      66
2   Dhoni      74
3  Yuvraj     103
4  Dhawan      45

In [36]:
df['Country'] = ['India','India','India','India','India','India','India']

In [37]:
df

    Names  Scores    Avg Country
0  Sachin      45  45.66   India
1   Virat      66  54.88   India
2   Dhoni      74  73.88   India
3  Yuvraj     103  63.22   India
4  Dhawan      45  22.43   India
5   Rahul      65  76.43   India
6    Pant      66  66.32   India

In [38]:
data = {
    'Names' : ['Smith', 'Kallis' , 'Pointing', 'Roy', 'Taylor'],
    'Scores' : [45,78,122,56,78],
    'Avg' : [45.63,67.76,93.77,102.33,89.33],
    'Country' : ['Aus','SA','Eng','AUs','Eng']
}

df_1 = pd.DataFrame(data)
df.append(df_1,ignore_index=True)

       Names  Scores     Avg Country
0     Sachin      45   45.66   India
1      Virat      66   54.88   India
2      Dhoni      74   73.88   India
3     Yuvraj     103   63.22   India
4     Dhawan      45   22.43   India
5      Rahul      65   76.43   India
6       Pant      66   66.32   India
7      Smith      45   45.63     Aus
8     Kallis      78   67.76      SA
9   Pointing     122   93.77     Eng
10       Roy      56  102.33     AUs
11    Taylor      78   89.33     Eng

In [39]:
df.shape

(7, 4)

In [40]:
df.head()

    Names  Scores    Avg Country
0  Sachin      45  45.66   India
1   Virat      66  54.88   India
2   Dhoni      74  73.88   India
3  Yuvraj     103  63.22   India
4  Dhawan      45  22.43   India

In [41]:
df['Scores'] > 100

0    False
1    False
2    False
3     True
4    False
5    False
6    False
Name: Scores, dtype: bool

# Filttering in Pandas

In [45]:
df[df['Scores'] > 100]

    Names  Scores    Avg Country
3  Yuvraj     103  63.22   India

In [70]:
df[(df['Scores'] > 50) & (df['Avg'] > 30)]

    Names  Scores    Avg Country
1   Virat      66  54.88   India
2   Dhoni      74  73.88   India
3  Yuvraj     103  63.22   India
5   Rahul      65  76.43   India
6    Pant      66  66.32   India

In [57]:
df['Scores'].max()

103

In [58]:
df['Scores'].min()

45

In [60]:
df['Scores'].argmax()

3

In [71]:
df.sort_values('Avg')

    Names  Scores    Avg Country
4  Dhawan      45  22.43   India
0  Sachin      45  45.66   India
1   Virat      66  54.88   India
3  Yuvraj     103  63.22   India
6    Pant      66  66.32   India
2   Dhoni      74  73.88   India
5   Rahul      65  76.43   India

In [64]:
df.sort_values("Avg", ascending = False).head().reset_index()

   index   Names  Scores    Avg Country
0      5   Rahul      65  76.43   India
1      2   Dhoni      74  73.88   India
2      6    Pant      66  66.32   India
3      3  Yuvraj     103  63.22   India
4      1   Virat      66  54.88   India

In [69]:
df.sort_values("Avg", ascending = False).head().reset_index(drop=True)

    Names  Scores    Avg Country
0   Rahul      65  76.43   India
1   Dhoni      74  73.88   India
2    Pant      66  66.32   India
3  Yuvraj     103  63.22   India
4   Virat      66  54.88   India

In [76]:
df.groupby("Country").sum('Scores')

         Scores     Avg
Country
India       464  402.82

In [75]:
df.groupby("Country").mean('Scores')

            Scores        Avg
Country
India    66.285714  57.545714